BaseConfiguration/Money_2_0/Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штраф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыСвышеПредела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыБезСпецоценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосрегистрацияОрганизацийЧерезМФЦ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/ВидыПлатежейВГосБюджет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = ПолучитьДоступныеЗначения(Параметры.Отбор, Параметры.СтрокаПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ВидыНалоговыхПлатежей() Экспорт
	
	ВидыПлатежей = Новый Массив;
	ВидыПлатежей.Добавить(Налог);
	ВидыПлатежей.Добавить(НалогАкт);
	ВидыПлатежей.Добавить(НалогСам);
	ВидыПлатежей.Добавить(ВзносыСвышеПредела);
	ВидыПлатежей.Добавить(ВзносыБезСпецоценки);
	ВидыПлатежей.Добавить(ГосрегистрацияОрганизацийЧерезМФЦ);
	
	Возврат ВидыПлатежей;
	
КонецФункции

Функция ЭтоПени(ВидНалоговогоОбязательства) Экспорт
	
	Если ТипЗнч(ВидНалоговогоОбязательства) <> ТипЗнч(ПустаяСсылка()) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидНалоговогоОбязательства = ПениАкт
		Или ВидНалоговогоОбязательства = ПениСам;
	
КонецФункции

Функция ЭтоПроценты(ВидНалоговогоОбязательства) Экспорт
	
	Если ТипЗнч(ВидНалоговогоОбязательства) <> ТипЗнч(ПустаяСсылка()) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидНалоговогоОбязательства = Проценты;
	
КонецФункции

Функция ЭтоШтраф(ВидНалоговогоОбязательства) Экспорт
	
	Если ТипЗнч(ВидНалоговогоОбязательства) <> ТипЗнч(ПустаяСсылка()) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидНалоговогоОбязательства = Штраф;
	
КонецФункции

Функция ЭтоВзносыСвышеПредела(ВидНалоговогоОбязательства) Экспорт
	
	Если ТипЗнч(ВидНалоговогоОбязательства) <> ТипЗнч(ПустаяСсылка()) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидНалоговогоОбязательства = ВзносыСвышеПредела;
	
КонецФункции

Функция ВидПлатежа(ВидНалоговогоОбязательства) Экспорт
	
	ТипЗначения = ТипЗнч(ВидНалоговогоОбязательства);
	
	Если ТипЗнч(ВидНалоговогоОбязательства) = ТипЗнч(ПустаяСсылка()) Тогда
		Возврат ВидНалоговогоОбязательства;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеВзносаИП(ВидПлатежаВГосБюджет) Экспорт
	
	Если ВидПлатежаВГосБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
		Возврат НСтр("ru = 'Взносы, постоянная часть'");
	ИначеЕсли ВидПлатежаВГосБюджет = Перечисления.ВидыПлатежейВГосБюджет.ВзносыСвышеПредела Тогда
		Возврат НСтр("ru = 'Взносы с доходов свыше предела'");
	Иначе
		Возврат "";
	КонецЕсли
	
КонецФункции

// Возвращает ссылку на значение перечисления по переданному имени.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВидыПлатежейВГосБюджет - ссылка на найденное значение перечисление или ПустаяСсылка().
//
Функция ВидНалоговогоОбязательстваПоИмени(ИмяНалоговогоОбязательства) Экспорт
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыПлатежейВГосБюджет.ЗначенияПеречисления Цикл
		
		Если ВРег(ЗначениеПеречисления.Имя) = ВРег(ИмяНалоговогоОбязательства) Тогда
			Возврат Перечисления.ВидыПлатежейВГосБюджет[ЗначениеПеречисления.Имя];
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Перечисления.ВидыПлатежейВГосБюджет.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДоступныеЗначения(Отбор, СтрокаПоиска)
	
	Исключения = Новый Массив;
	
	Если ПлатежиВБюджетКлиентСервер.ДействуетПриказ2017_90н(ДобавитьМесяц(ОбщегоНазначения.ТекущаяДатаПользователя(),-3)) Тогда
		Исключения.Добавить(Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию);
		Исключения.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПолученоИзФонда);
		Исключения.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НеПринято);
	КонецЕсли;
	
	// ДЕНЬГИ код удален
	
	ДоступныеЗначения = Новый СписокЗначений;
	
	Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыПлатежейВГосБюджет.ЗначенияПеречисления Цикл
		
		Если ТипЗнч(СтрокаПоиска) = Тип("Строка")
			И НЕ ПустаяСтрока(СтрокаПоиска)
			И СтрНайти(НРег(ЗначениеПеречисления.Синоним), НРег(СтрокаПоиска)) <> 1 Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Перечисления.ВидыПлатежейВГосБюджет[ЗначениеПеречисления.Имя];
		Если ТипЗнч(Отбор) = Тип("ПеречислениеСсылка.ВидыПлатежейВГосБюджет")
			И Отбор <> Ссылка Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(Отбор) = Тип("ФиксированныйМассив")
			И Отбор.Найти(Ссылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Исключения.Найти(Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДоступныеЗначения.Добавить(Ссылка, ЗначениеПеречисления.Синоним);
		
	КонецЦикла;
	
	Возврат ДоступныеЗначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
